Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གྱི་མིང་ཡང་མེད་པས་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་སེམས་ཅན་ཡོད་དོ་ཞེས་གང་སྨྲས་པའི་ཚིག་དེ་རང་ཉིད་ཀྱིས་བཤིག་པ་ཡིན་ནོ་ཞེས་སྨྲོས་ཤིག །
en: for neither sentient beings nor even the names of sentient beings exist from the perspective of the definitive ultimate.’

source: གཞན་ཡང་གླང་པོ་ཆེའི་ལག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལས་ཆོས་རྣམས་འགག་པ་མེད་པར་གསུངས་པ་ཡང་སྡུག་བསྔལ་ཉེ་བར་ཞི་བར་མཛད་པ་ཡིན་ཏེ། ངས་དེ་ལྟར་ཆོས་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པས་ཇི་ལྟར་ཐུགས་སུ་ཆུད་པའི་ཆོས་རྣམས་སེམས་ཅན་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དང་། རབ་ཏུ་དབེན་པ་དང་། སྤྲོས་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པ་ཉིད་བསྟན་པ་ཡིན་ནོ།
en: “Furthermore, Elephant Trunk, although in the Thus-Gone One’s teachings it is stated that phenomena do not cease, that brings peace from suffering, for since I have fully realized the characteristics of the true nature of phenomena in that way, I teach to sentient beings that phenomena, as I understand them, are not to be craved, should be disengaged from, should not conceptualized or formed, and are without any arising.’

source: །གླང་པོ་ཆེའི་ལག་གང་གིས་དེ་ལྟར་ངས་བསྟན་པའི་ཆོས་ཀྱི་དོན་ཤེས་པ་དེས་ཅི་ཡོད་པ་དང་མེད་པའི་ཆེད་དུ་ལས་ཀྱི་སྤྱོད་པ་སློང་བར་མི་བྱེད་དོ།
en: “Elephant Trunk, someone who understands the meaning of the Dharma that I teach does not get involved in karmic actions driven by fixation on existence or nonexistence.

source: །གང་གིས་ཡོད་པ་དང་། མེད་པའི་ཆེད་དུ་ལས་ཀྱི་སྤྱོད་པ་མི་སློང་བ་དེས་ཇི་ལྟར་སེམས་ཅན་ཡོད་པ་དང་སེམས་ཅན་མེད་པར་མཐོང་བར་འགྱུར་ཏེ།
en: How could someone who does not get involved in karmic actions driven by fixation on existence or nonexistence perceive sentient beings in terms of existence or nonexistence?

source: གླང་པོ་ཆེའི་ལག་འདི་ནི་རྟག་པར་ཆོས་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་མཚན་ཉིད་ལ་གནས་པ་ཞེས་བྱ་སྟེ།
en: Elephant Trunk, this is known as constantly abiding in the characteristics of the true nature of phenomena.

source: འདི་ལ་ནི་རྗེས་སུ་དྲན་པའི་འདུ་ཤེས་ཀྱི་རྣམ་པར་རྟོག་པ་ཡང་མེད། དྲི་མ་ཡང་མེད། ཡོངས་སུ་དག་པ་ཡང་མེད། འོང་བ་ཡང་མེད། འགྲོ་བ་ཡང་མེད། ལམ་ཡང་མེད། ལམ་གྱི་འབྲས་བུ་ཡང་མེད། རིང་པོ་ཡང་མེད། ཐུང་ངུ་ཡང་མེད། གྲུ་བཞི་ཡང་མེད། ཟླུམ་པོ་ཡང་མེད། དབྱིབས་ཀྱང་མེད། ཁ་དོག་ཀྱང་མེད་པས་དེའི་ཕྱིར་ཆོས་རྣམས་ནི་སྒོ་གཅིག་ཁོ་ན་སྟེ། འདི་ལྟར་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཞེས་བསྟན་པ་ཡིན་ནོ།
en: “This realization transcends all concepts of recollection. It also transcends all concepts of impurity, purity, coming, going, the path, and the result of the path, and all characteristics such as long, short, square, and round, as well as all other notions of shape and color. Therefore, phenomena share a single mode, which is described as the gateway of absorption.

source: །གླང་པོ་ཆེའི་ལག་འདི་ནི་ཆོས་ཀྱི་སྒོ་མཐོང་བ་ཞེས་བྱ་སྟེ།
en: Elephant Trunk, this is also called seeing the gateway to the Dharma.

source: གང་གིས་ཆོས་མཐོང་བའི་སྒོར་ཞུགས་པ་འདི་ནི་སངས་རྒྱས་མཐོང་བ་ཞེས་བྱའོ།
en: Whoever enters this gateway to the Dharma vision is known as someone who sees the Buddha.

source: །གླང་པོ་ཆེའི་ལག་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Elephant Trunk, what do you think:

source: ཆོས་གང་གིས་སངས་རྒྱས་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཅི་འགགས་པ་དང་། འགག་པ་དང་། འགག་པར་འགྱུར་བའི་འགག་པའི་མཚན་ཉིད་ཅིག་ཡིན་སྙམ་མམ་།
en: Does a phenomenon perceived to be the Buddha have the characteristic of cessation—has it ceased, is it ceasing, or will it cease?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: “No, Blessed One, it does not.”

source: །འདི་ཇི་སྙམ་དུ་སེམས།
en: “What do you think:

source: ཆོས་གང་གིས་སངས་རྒྱས་མཐོང་བར་གྱུར་པའི་ཆོས་དེའི་སྐྱེས་པ་དང་། སྐྱེ་བ་དང་། སྐྱེ་བར་འགྱུར་བའི་སྐྱེ་བའི་མཚན་ཉིད་ཅིག་ཡིན་སྙམ་མམ་།
en: Does a phenomenon perceived to be the Buddha have the characteristic of arising—has it arisen, is it arising, or will it arise?”

source: །གླང་པོ་ཆེའི་ལག་གལ་ཏེ་དེ་ལྟ་ན་དེ་བཞིན་གཤེགས་པ་ནི་འགག་པ་ཞེས་མི་བྱའོ།
en: “Elephant Trunk, if it is so, it should not be said that the Thus-Gone One ceases.”

source: །བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་སོ།
en: “Blessed One, that is true.”

source: །གླང་པོ་ཆེའི་ལག་དེ་གལ་ཏེ་འདི་སྐད་དུ་སྐུའི་མཚན་དང་ལྡན་པས་བདག་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་འདས་པར་ཞུགས་ནས་སླར་ལྡོག་པར་མི་འགྱུར་རོ་ཞེས་སྨྲས་པ་ཡང་སྐུའི་མཚན་ཉིད་ཕྱིར་མི་ལྡོག་པར་མཐོང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འགགས་པ་ཞེས་བྱའོ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་དུ་དྲིས་ཤིག །ཅི་ཁྱོད་སྐུའི་མཚན་ཡོངས་སུ་གྲུབ་པ་ལ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བར་འདོད་དམ།
en: “Elephant Trunk, if they then say that it is because I possess the physical marks that once I have entered into the complete nirvāṇa of a thus-gone one I will not return, and also if they claim that because the physical marks are seen to be irreversible, the Thus-Gone One ceases, ask them, ‘Do you claim that the formation of physical marks is the Thus-Gone One?’

source: དེས་གལ་ཏེ་འདི་སྐད་དུ་བདག་ནི་སྐུའི་མཚན་ཡོངས་སུ་གྲུབ་པ་ལ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་འདོད་དོ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་དུ་སྨྲོས་ཤིག །དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་གསུང་རབ་ལས་ནི་སྐུའི་མཚན་ལ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ་ཞེས་མ་གསུངས་ཏེ།
en: “They may answer, ‘We claim that the formation of the physical marks is the Thus-Gone One.’ In that case, you should tell them, ‘In the discourses spoken by the Thus-Gone One, the physical marks are not said to be the Thus-Gone One.

source: གལ་ཏེ་སྐུའི་མཚན་ཡང་དེ་བཞིན་གཤེགས་པ་ཡིན་ནོ་ཞེས་བརྗོད་ན་ནི་གྱོ་མོ་དང་། རྡོ་དང་། རི་དང་། ཀླུང་དང་། རྩྭ་ཤིང་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཡིན་པར་འགྱུར་རོ།
en: If it were said that the physical marks are the Thus-Gone One, everything—gravel, stones, mountains, rivers, grass, and forests—would also be the Thus-Gone One.’

source: །དེ་གལ་ཏེ་འདི་སྐད་དུ་གྱོ་མོ་དང་། རྡོ་དང་། རི་དང་། ཀླུ་དང་། རྩྭ་ཤིང་ཐམས་ཅད་ལ་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མེད་པས་དེ་བཞིན་གཤེགས་པ་ཞེས་མི་བྱའོ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་དུ་སྨྲོས་ཤིག །ཁྱོད་ཀྱིས་སྨྲས་པ་ད་ལྟར་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་ལ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་དེ་བཞིན་གཤེགས་པ་ཡིན་པའི་རིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “They may retort, ‘All gravel, stones, mountains, rivers, grass, and forests are not the Thus-Gone One, for they do not have the thirty-two major marks of a great being.’ In that case, reply to them, ‘If you now call someone who possesses the thirty-two major marks a thus-gone one, it follows that a universal monarch is also a thus-gone one. Why?

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པས་སོ།
en: Because a universal monarch likewise possesses the thirty-two major marks.’

source: །དེ་གལ་ཏེ་འདི་སྐད་དུ་མཚན་ནི་མཚན་གྱི་ཆོས་ལ་འཇུག་པར་འགྱུར་བས་མཚན་ཤེས་པའི་བྲམ་ཟེས་ཀྱང་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པའི་དངོས་པོ་དེ་བདེན་པས་སོ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་དུ་སྨྲོས་ཤིག །གལ་ཏེ་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཡིན་ན་ནི་ཁྱོད་བདག་ཉིད་ཀྱིས་མཚན་མཁན་གྱིས་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་མཐོང་བས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་ཡིན་ནོ་ཞེས་སྨྲས་པས་དེང་ཁྱོད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་མཚན་ཤོད་ཅིག
en: “They may object, ‘Since the marks of a thus-gone one can be identified due to their qualities, brahmins with knowledge of such marks can correctly predict when one will become a buddha.’ To that, you should answer, ‘If you maintain that someone who possesses the thirty-two major marks is a thus-gone one, and if you say that a brahmin with knowledge of marks can predict that someone will become a perfect buddha based on seeing the presence of those thirty-two major marks, you should now explain what the marks of a thus-gone one consist in.’

source: །དེ་གལ་ཏེ་འདི་སྐད་དུ་བདག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། མ་འདྲེས་པའི་ཆོས་བཅྭ་བརྒྱད་དང་། ཟག་པ་མེད་པའི་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་ལ་སོགས་པ་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་དུ་བསྟན་ཏོ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲོས་ཤིག །
en: “They may reply, ‘The thus-gone ones’ ten strengths, four fearlessnesses, eighteen unique qualities, undefiled powers, strengths, limbs of enlightenment, path, concentration, liberation, absorption, and so on, are taught to be the marks.’ In that case, tell them, ‘Since you claim that the thus-gone ones’ ten strengths and so on are the marks of a thus-gone one, you should now explain what the nature of a thus-gone one consists in.’ “To that, they may ask, ‘Are the Buddha and his marks separate?’ In that case, you should reply, ‘You have already said that the marks are the Buddha, although they are not!’

source: ཁྱོད་ཀྱིས་སྟོབས་བཅུ་ལ་སོགས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཡིན་ནོ་ཞེས་སྨྲས་པས་དེང་ཁྱེད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་ཇི་ལྟ་བུ་ཡིན་པ་ཤོད་ཅིག །དེ་གལ་ཏེ་འདི་སྐད་དུ་ཅི་སངས་རྒྱས་དང་མཚན་ཐ་དད་པ་ཞིག་ཡིན་ནམ་ཞེས་ཟེར་ན། དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ཉིད་མཚན་སངས་རྒྱས་ཡིན་ནོ་ཞེས་ཟེར་བར་ཟད་ཀྱི། མཚན་ནི་སངས་རྒྱས་མ་ཡིན་ནོ་ཞེས་སྨྲོས་ཤིག །དེ་གལ་ཏེ་ཡང་འདི་སྐད་དུ་དབྱིབས་མེད་ཅིང་ཁ་དོག་མེད་པའི་ཆོས་གཞན་ཞིག་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་ལ་སོགས་པའི་མཚན་ཉིད་བྱེད་པར་འགྱུར་རམ་ཞེས་ཟེར་ན་དེ་ལ་འདི་སྐད་དུ་སྨྲོས་ཤིག །དབྱིབས་མེད་ཅིང་ཁ་དོག་མེད་པའི་ཆོས་ཇི་ལྟར་དབྱིབས་དང་བཅས་ཤིང་ཁ་དོག་དང་བཅས་པའི་མཚན་ཉིད་བྱེད་པར་འགྱུར།
en: “If they ask again, ‘Do other shapeless and colorless phenomena, such as the ten strengths, act as the marks of the Buddha?’ you should tell them in return, ‘How can shapeless and colorless phenomena act as the marks of something possessing shape and color?

source: གཞན་ཡང་ཁྱོད་ཀྱིས་གལ་ཏེ་དབྱིབས་མེད་ཅིང་ཁ་དོག་མེད་པའི་ཆོས་ལ་སངས་རྒྱས་ཤེས་བྱའོ་ཞེས་ཟེར་ན། འོ་ན་ནི་གཞན་དབྱིབས་མེད་ཅིང་ཁ་དོག་མེད་པའི་ཆོས་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཡིན་པར་འགྱུར་བའི་རིགས་སོ།
en: Furthermore, if you claim that shapeless and colorless phenomena are the Buddha, it then follows that all the other shapeless and colorless phenomena are also the Buddha.

source: །གལ་ཏེ་ཆོས་དེ་དག་སངས་རྒྱས་ཡིན་པར་གྱུར་ན་ནི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། མ་འདྲེས་པའི་ཆོས་བཅྭ་བརྒྱད་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་ལ་སོགས་པ་ཡང་དེའི་མཚན་ཉིད་བྱེད་པར་འགྱུར་བའི་རིགས་སོ་ཞེས་བརྗོད་པར་བྱའོ། །གླང་པོ་ཆེའི་ལག་ངའི་ཉན་ཐོས་རྣམས་ནི་དེ་ལྟར་སྐྱེས་བུ་བླུན་པོ་རྣམས་རབ་ཏུ་འདུལ་བར་བྱེད་དོ།
en: Then, if those colorless phenomena were the Buddha, it would also be reasonable to say that the ten strengths, four fearlessnesses, eighteen unique qualities, inexhaustible powers, strengths, limbs of enlightenment, path, concentration, liberation, absorption, and so on, would also function as their marks.’ Elephant Trunk, this is how my hearers thoroughly train foolish beings.

source: །གཞན་ཡང་གླང་པོ་ཆེའི་ལག་ངས་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བཟླ་བར་བྱའོ་ཞེས་སྨོན་ལམ་བཏབ་མོད་ཀྱི།
en: “Furthermore, Elephant Trunk, in the past I did indeed make the aspiration to fully awaken to unsurpassed and perfect buddhahood and then liberate all beings.

source: ང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་སེམས་ཅན་ཡང་མ་དམིགས།
en: However, when I fully awoke to unsurpassed and perfect buddhahood, as I sat upon the seat of awakening, I did not apprehend any sentient beings. I did not even apprehend the name sentient beings.

source: སེམས་ཅན་གྱི་མིང་ཡང་མ་དམིགས་པས་ང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་ཚེ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་པའི་ཆོས་དངོས་པོ་འདི་ཡོད་པའི་ཕྱིར་དངོས་པོ་འདི་ཡོད། དངོས་པོ་འདི་མེད་པའི་ཕྱིར་དངོས་པོ་འདི་མེད་པར་རྟོགས་པ་ཁོ་ནར་ཟད་དོ།
en: Therefore, as I sat upon the seat of awakening, my understanding consisted entirely of the twelve links of dependent arising—the fact that things exist when other things exist, and they are absent when other things are absent.

source: །དངོས་པོ་གང་ཡོད་པའི་ཕྱིར་དངོས་པོ་གང་ཡོད། དངོས་པོ་གང་མེད་པའི་ཕྱིར་དངོས་པོ་གང་མེད་པར་གྱུར་ཅེ་ན་འདི་ལྟ་སྟེ།
en: “What are the things that exist when other things exist, and what things are absent when other things are absent?

source: མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཡོད་པར་གྱུར།
en: Due to ignorance, there are formations.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: Due to formations, there is consciousness.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: Due to consciousness, name and form arise.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ།
en: Due to name and form, the six sense sources arise. Due to the six sense sources, contact arises.

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: Due to contact, feeling arises.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ།
en: Due to feeling, craving arises.

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ།
en: Due to craving, appropriation arises.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: Due to appropriation, becoming arises.

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ།
en: Due to becoming, birth arises.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི།
en: Due to birth, old age and death arise.

source: རྒ་ཤིའི་རྐྱེན་གྱིས་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཡོད་པར་འགྱུར་ཏེ། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་དག་འབྱུང་བར་འགྱུར་རོ།
en: Due to old age and death, grief, lamentation, suffering, despair, and anxiety arise. Thus do these great masses of pure suffering arise.

source: །མ་རིག་པ་འགགས་པའི་ཕྱིར་འདུ་བྱེད་རྣམས་འགག །འདུ་བྱེད་རྣམས་འགགས་པའི་ཕྱིར་རྣམ་པར་ཤེས་པ་འགག །རྣམ་པར་ཤེས་པ་འགགས་པའི་ཕྱིར་མིང་དང་གཟུགས་འགག །མིང་དང་གཟུགས་འགགས་པའི་ཕྱིར་སྐྱེ་མཆེད་དྲུག་འགག །སྐྱེ་མཆེད་དྲུག་འགགས་པའི་ཕྱིར་རེག་པ་འགག །རེག་པ་འགགས་པའི་ཕྱིར་ཚོར་བ་འགག །ཚོར་བ་འགགས་པའི་ཕྱིར་སྲེད་པ་འགག །སྲེད་པ་འགགས་པའི་ཕྱིར་ལེན་པ་འགག །ལེན་པ་འགགས་པའི་ཕྱིར་སྲིད་པ་འགག །སྲིད་པ་འགགས་པའི་ཕྱིར་སྐྱེ་བ་འགག །སྐྱེ་བ་འགགས་པའི་ཕྱིར་རྒ་ཤི་འགག །རྒ་ཤི་འགགས་པའི་ཕྱིར་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་དག་འགག་པར་འགྱུར་རོ།
en: “Due to the cessation of ignorance, formations cease. Due to the cessation of formations, consciousness ceases. Due to the cessation of consciousness, name and form cease. Due to the cessation of name and form, the six sense sources cease. Due to the cessation of the six sense sources, contact ceases. Due to the cessation of contact, feeling ceases. Due to the cessation of feeling, craving ceases. Due to the cessation of craving, appropriation ceases. Due to the cessation of appropriation, becoming ceases. Due to the cessation of becoming, birth ceases. Due to the cessation of birth, old age and death cease. Due to the cessation of old age and death, grief, lamentation, suffering, despair, and anxiety cease. Thus do these great masses of pure suffering cease.

source: །ང་དེ་ལས་མིག་དང་། ཡེ་ཤེས་དང་། རིག་པ་དང་། བློ་སྐྱེས་པས་འདི་ལྟར་དབུས་དང་མཐའ་མེད་པ་དང་། འཇིགས་པ་མེད་པའི་རྣམ་པར་གྲོལ་བ་རབ་ཏུ་རྟོགས་པར་གྱུར་ཏོ།
en: “Because my vision, wisdom, knowledge, and intellect have arisen on that basis, I have fully realized liberation, which is beyond center and edge and free from fear.

source: །དེ་བཞིན་གཤེགས་པས་རྣམ་པར་གྲོལ་བ་དེ་རབ་ཏུ་རྟོགས་པའི་ཕྱིར་ཆོས་གཞན་གང་ཡང་ཐོབ་པར་གྱུར་པ་མེད་ཀྱི། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བའི་ཆོས་དམིགས་པ་ཁོ་ནར་ཟད་དོ།
en: Because the thus-gone ones have fully actualized such liberation, they only apprehend phenomena arising from causes and conditions. They have no other attainment besides that.

source: །གླང་པོ་ཆེའི་ལག་དེ་བཞིན་གཤེགས་པ་ནི་ཇི་ལྟར་ཆོས་རྣམས་རབ་ཏུ་རྟོགས་པ་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ།
en: Elephant Trunk, the thus-gone ones teach the nature of phenomena to sentient beings in the exact way they have realized it.

source: །གླང་པོ་ཆེའི་ལག་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་འགྱུར་བ་མེད་པར་རྟག་ཏུ་གནས་པས་འདི་ལྟ་སྟེ། མིང་དང་གཟུགས་ཀྱང་སྟོར་བར་མི་འགྱུར་ལ། ཕན་ཚུན་འགལ་བ་ཡང་མེད། སྐྱེ་བ་ཡང་མེད། འབྱུང་བ་ཡང་མེད་དོ།
en: Elephant Trunk, whether or not the thus-gone ones have appeared, the nature of phenomena always remains the same—name and form are not lost, there are no mutual contradictions, and they are beyond birth and arising.

source: །གླང་པོ་ཆེའི་ལག་ང་ནི་རྟག་པར་དེ་ལྟར་ཆོས་སྟོན་པས་ཁྱེད་ཀྱིས་ཀྱང་ངའི་དགོངས་པ་བཞིན་དུ་རིག་པར་བྱའོ།
en: “Elephant Trunk, I am always teaching the Dharma in that way, so you too should understand it according to my intent.

source: །ངས་ཁྱེད་ལ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ན་ཁྱེད་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱའོ།
en: When I teach such a Dharma to you, you should practice it accordingly, with persistent efforts.

source: །གླང་པོ་ཆེའི་ལག་སྟོན་པ་ཆེན་པོས་སློབ་པ་རྣམས་ལ་གང་བྱ་བའི་རིགས་པ་དེ་དག་ངས་མ་ལུས་པར་བྱས་ཟིན་པས་ཁྱེད་ཀྱིས་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་དུ་མངོན་པར་བསྒྲུབས་ནས་ཆོས་རྣམས་ལས་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཐོབ་པར་བྱའོ།
en: Elephant Trunk, I have already done all the appropriate things that a great teacher should do for his disciples. Therefore, you should practice in accordance with the way I have taught, and thereby gain the light of wisdom with respect to phenomena!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་གླང་པོ་ཆེའི་ལག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Venerable Elephant Trunk asked the Blessed One,

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་འགའ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཡང་དག་པའི་ཆོས་ནུབ་པར་གྱུར་པ་ཞིག་ཡིན་ན་སུ་ཞིག་ལམ་སྟོན་པར་འགྱུར། ལམ་སྟོན་པ་མེད་པའི་ཕྱིར་དམ་པའི་ཆོས་ནུབ་པ་ཞེས་བྱའོ།
en: “Blessed One, how should one answer when others raise the following concern: ‘If the authentic Dharma, which was expounded by the Thus-Gone One, vanished, who would teach the path? Without a teacher of the path, the sacred Dharma would vanish.

source: །དམ་པའི་ཆོས་ནུབ་པར་གྱུར་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་ནུབ་པ་ཞེས་བྱ་བས་འདི་ཡང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཟླས་པ་ཞེས་བྱའོ་ཞེས་མཆི་ན་དེ་ལ་ཇི་སྐད་དུ་ལན་གདབ་པར་བགྱི་ལགས།
en: Since the sacred Dharma would have vanished, the thus-gone ones too would disappear. Therefore, no sentient being could be liberated.’ ”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གླང་པོ་ཆེའི་ལག་གལ་ཏེ་དེ་སྐད་དུ་འདྲི་བ་ཡོད་ན་དེ་ལ་འདི་སྐད་དུ་ལན་གདབ་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཡིན་པར་སྐྱེ་བོ་མང་པོ་ཀུན་གྱིས་ཀྱང་ཤེས་ཤིང་མཐོང་ལ།
en: “Elephant Trunk,” answered the Blessed One, “if those arguments are raised, you should answer by saying, ‘Everyone knows and sees that the thus-gone ones are omniscient.

source: རྟག་པར་སེམས་ཅན་བཟླ་བའི་དུས་ལས་གཞེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཀྱང་ད་དུང་ཕན་པ་མཛད་པ་ཡིན་ནོ།
en: Moreover, they always wait for the opportunity to liberate sentient beings. Therefore, they continue to benefit others, even after they pass into nirvāṇa.

source: །གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་མ་འོངས་པའི་སངས་རྒྱས་རྣམས་ལ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་ལུང་སྟོན་པར་མཛད་པས་དེ་ཉིད་སངས་རྒྱས་ཀྱི་གདུང་བསབ་ཅིང་རྒྱུན་མི་གཅོད་པར་མཛད་པ་ཡིན་ཏེ།
en: Furthermore, because the thus-gone ones prophesy to future buddhas how they will fully awaken to perfect buddhahood, the lineage of the buddhas remains uninterrupted.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ནི་སངས་རྒྱས་གཅིག་གི་ཆོས་ཡིན་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཞེས་བྱའོ་ཞེས་བསྟན་ཏོ།
en: Since the Dharma of all the buddhas is also the Dharma of every single buddha, it is called the Dharma of the Thus-Gone One.

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཡིན་པས་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་སྤྱོད་ཅིང་ཇི་ལྟར་སྤྱོད་པ་བཞིན་དུ་གསུང་བ་ཡིན་པར་རིག་པར་བྱའོ། །ཞེས་བརྗོད་པར་བྱའོ། །
en: The Dharma of the Thus-Gone One is the Dharma of the Buddha. Therefore, you should know that in the past, when the Thus-Gone One practiced bodhisattva conduct, his actions always accorded with his words, and his words always accorded with his actions.’ ”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་གླང་པོ་ཆེའི་ལག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་ལེགས་པར་ཐུགས་སུ་ཆུད་པ་ལགས་ཏེ།
en: “Blessed One,” said Venerable Elephant Trunk, “the Thus-Gone One comprehends perfectly how to investigate all phenomena.

source: ཆོས་ཐམས་ཅད་ལེགས་པར་ཐུགས་སུ་ཆུད་པའི་སླད་དུ་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་ཕྲིན་ལས་མཁྱེན་པ་སྔོན་དུ་གཏོང་ཞིང་མཁྱེན་པའི་རྗེས་སུ་འབྲང་བས་ན་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མཛད་ཅིང་ཇི་ལྟར་མཛད་པ་བཞིན་དུ་གསུང་བར་གྱུར་བ་ནི་ཤིན་དུ་ངོ་མཚར་ཆེ་ལགས་སོ།
en: In order to comprehend perfectly all phenomena, he has guided his physical, verbal, and mental activities with insight. By following insight in that way, when he was practicing bodhisattva conduct in the past, the actions of the Blessed One always accorded with his words, and his words always accorded with his actions. This is truly amazing!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གླང་པོ་ཆེའི་ལག་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: The Blessed One exclaimed, “Thus it is, Elephant Trunk, thus it is!

source: གླང་པོ་ཆེའི་ལག་ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་ང་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་སྤྱོད་ཅིང་ཇི་ལྟར་སྤྱོད་པ་བཞིན་དུ་སྨྲས་པར་གྱུར་བ་ཡིན་ནོ།
en: Elephant Trunk, as you have said, when I was practicing bodhisattva conduct in the past, my actions always accorded with my words, and my words always accorded with my actions.

source: །གླང་པོ་ཆེའི་ལག་ཡང་དག་པར་སྨྲ་བ་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་སུ་ཞིག་ནོར་བ་མེད་པར་འཇིག་རྟེན་དུ་བྱུང་ནས་སེམས་ཅན་ལ་ཕན་འདོགས་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བདེ་བ་ལ་འགོད་པ་དང་། ཐམས་ཅད་ཀུན་གྱི་སྟོན་པ་ཆེན་པོར་གྱུར་ནས་ཡང་དག་པའི་ལམ་སྟོན་པ་དང་། ཡང་དག་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་གྲོལ་བས་སྤྲོས་པ་མི་མངའ་བར་ཕ་རོལ་ཏུ་བྱོན་ནས་ད་དུང་མ་རྒལ་བ་དག་ཡོངས་སུ་ཟློས་ཤེས་ཟེར་བ་ལ། དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ང་ཡིན་ནོ་ཞེས་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནོ།
en: Elephant Trunk, someone who speaks sincerely might ask, ‘Who is the one who was born into this world without flaws? He benefits sentient beings and establishes the world together with its gods in a state of happiness. Acting as everyone’s great teacher, he teaches the authentic path. Since he is liberated through his genuine wisdom, he is free from conceptual elaborations. Having passed to the other shore, he liberates those who have not yet crossed over.’ To that, I would have to answer, ‘I am that one, the Buddha, the Thus-Gone One,’ and those words would be truthful.

source: །གླང་པོ་ཆེའི་ལག་ཡང་དག་པར་སྨྲ་བ་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་སུ་ཞིག་སླུ་བ་མེད་ཅིང་བྱ་བ་བྱས་པའི་དྲིན་གཟོ་བ་ཡིན་ཞེས་ཟེར་བ་ལ་དེ་ནི་ང་ཡིན་ནོ་ཞེས་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ཏེ།
en: Elephant Trunk, someone who speaks sincerely might ask, ‘Who is undeceiving and repays the kindness of past actions?’ To that, I would have to answer, ‘It is I,’ and those words would be truthful.

source: སེམས་ཅན་གང་ལ་ལ་ཞིག་ང་ལ་བྱ་བ་ཅུང་ཟད་ཅིག་བྱས་པའི་དངོས་པོ་དེ་ཡང་ཆུད་ཟ་བར་མི་འགྱུར་རོ།
en: Even the smallest deeds done by sentient beings for my sake will never be wasted.

source: །གླང་པོ་ཆེའི་ལག་ང་ནི་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཚུན་ཆད་བར་ནམ་ཡང་སེམས་ལ་ལྡོག་ཅིང་གྱུར་བ་ཡང་མེད་ལ།
en: “Elephant Trunk, since I first gave rise to the mind set on unsurpassed and perfect awakening, my mind has never turned away from it or wavered.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མངོན་པར་ཞེན་ཅིང་མོས་པར་གྱུར་པ་ཡང་དག་པར་རྗེས་སུ་མི་དྲན་ཡང་ངས་ཆོས་དེ་བསྟན་པས་ངའི་འཁོར་རྣམས་ལས་སེམས་རྩེ་གཅིག་ཏུ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་ཡོངས་སུ་གཉེར་བ་དག་གཟུང་བའི་ཕྱིར་འདུན་པར་གྱུར་བ་ཁོ་ནར་ཟད་དོ།
en: I do not recall ever having clung to or longed for the vehicles of the hearers and solitary buddhas. After hearing these teachings, I only wanted, with one-pointed resolve, to guide those among my retinue who pursue the fruition of the hearers and solitary buddhas.

source: །གླང་པོ་ཆེའི་ལག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་ང་མུ་སྟེགས་ཅན་གྱི་དྲང་སྲོང་དུ་གྱུར་པའི་ཚེ་ཤེས་རབ་གསལ་ཞིང་རྣོ་ལ་མང་དུ་ཐོས་ཤིང་སྤོབས་པ་དང་ལྡན་པར་གྱུར་པས་ཆོས་ཟབ་མོའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: “Elephant Trunk, once in the past, I was a non-Buddhist sage. My insight was clear and sharp, I was very erudite and eloquent, and I had reached acceptance of the profound Dharma.

source: །དེའི་ཚེ་བྲམ་ཟེ་གཞོན་ནུ་ལྔ་བརྒྱ་ཞིག་ཁྱིམ་ན་གནས་པ་དང་། འདོད་པ་ལྔའི་ཉེས་དམིགས་མཐོང་ཞིང་རབ་ཏུ་བྱུང་བའི་ཕན་ཡོན་མཐོང་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། ལམ་བསྒོམས་པར་གྱུར་ཏོ།
en: At that time there were five hundred young brahmins who understood the defects associated with keeping a household and the five sense desires, as well as the benefits of monastic life. Accordingly, they renounced their households, became ordained as homeless monks, and cultivated the path.
